Revit 2024 API
BuiltInFailures.CutterFailures.MakeCutterForPlanRegionsGStepFailed Property
 Failed to make cutter for plan view with plan regions. Try deleting one or more plan regions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MakeCutterForPlanRegionsGStepFailed { get; }
Visual Basic
Public Shared ReadOnly Property MakeCutterForPlanRegionsGStepFailed As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MakeCutterForPlanRegionsGStepFailed {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CutterFailures Class
Autodesk.Revit.DB Namespace